{
  "name": "Challenges",
  "slug": "challenges",
  "topics": [
    {
      "id": "1",
      "title": "Two Sum",
      "slug": "two-sum",
      "content": "challenges/two-sum/lesson.md",
      "files": [
        "challenges/two-sum/main.mo"
      ],
      "solution": "challenges/two-sum/solution.md",
      "description": "Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target.",
      "difficulty": "Easy",
      "hints": [
        "A really brute force way would be to search for all possible pairs of numbers but that would be too slow. Again, it's best to try out brute force solutions for just for completeness. It is from these brute force solutions that you can come up with optimizations.",
        "So, if we fix one of the numbers, say x, we have to scan the entire array to find the next number y which is value - x where value is the input parameter. Can we change our array somehow so that this search becomes faster?",
        "The second train of thought is, without changing the array, can we use additional space somehow? Like maybe a hash map to speed up the search?"
      ],
      "topics": [
        "Array",
        "Hash Table",
        "Hash Table",
        "Hash Table",
        "Hash Table",
        "Hash Table",
        "Hash Table"
      ]
    },
    {
      "id": "2",
      "title": "Palindrome",
      "slug": "palindrome",
      "content": "challenges/palindrome/lesson.md",
      "files": [
        "challenges/palindrome/main.mo"
      ],
      "solution": "challenges/palindrome/solution.md",
      "description": "Given an integer x, return true if x is a palindrome, and false otherwise.",
      "difficulty": "Easy",
      "hints": [
        "Beware of overflow when you reverse the integer."
      ],
      "topics": [
        "Math"
      ]
    },
    {
      "id": "3",
      "title": "Add Two Numbers",
      "slug": "add-two-numbers",
      "content": "challenges/palindrome/lesson.md",
      "files": [
        "challenges/palindrome/main.mo"
      ],
      "solution": "challenges/palindrome/solution.md",
      "description": "You are given two non-empty linked lists representing two non-negative integers. The digits are stored in reverse order, and each of their nodes contains a single digit. Add the two numbers and return the sum as a linked list.",
      "difficulty": "Medium",
      "hints": [],
      "topics": [
        "Math", "Linked List", "Recursion"
      ]
    }
  ]
}